chore(readme): Mermaid diagram
